Tekla Open API Reference for Tekla Structures 2025
DPMPrinterAttributes.PrintToMultipleSheet Property
 Whether to print to multiple sheets.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DotPrintToMultipleSheet PrintToMultipleSheet { get; set; }
Public Property PrintToMultipleSheet As DotPrintToMultipleSheet
	Get
	Set
Property Value
Type: DotPrintToMultipleSheet
See Also
Reference
DPMPrinterAttributes Class
Tekla.Structures.Drawing Namespace